/*******************************版权信息*************************************
 * 文件名称 : Tray.h
 * 文件版本 : 1.0
 * 开发人员 : Yao
 * 更新日期 : 2010.02.24
 * 文件说明 : interface for the CTray class.
 ****************************************************************************/

//////////////////////////////////////////////////////////////////////

#if !defined(AFX_TRAY_H__C7FF953F_4799_48D0_BCDD_2FE4A73499D1__INCLUDED_)
#define AFX_TRAY_H__C7FF953F_4799_48D0_BCDD_2FE4A73499D1__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

//#include "AppConfig.h"
#include "../Kernel/AppConfig.h"
/*
 * 类的名称 : CTray
 * 基本用途 : 定义应用程序托盘操作类的相关属性和方法，为高层组件提供统一的调用接口
 */

class CTray  
{
public:
	/***************************************************************************/
	/*************************CTray对视图层提供的统一接口***********************/
	/***************************************************************************/
	void DeleteTray();									//删除托盘
	void ToTray();										//最小化到托盘
	CTray(HWND m_hWnd, int _uID);
	virtual ~CTray();
private:
	/***************************************************************************/
	/**************************CTray类的属性定义********************************/
	/***************************************************************************/
	HWND m_hWnd;										//视图层句柄，用于和视图层交互
	int _uID;											//视图资源号
};

#endif // !defined(AFX_TRAY_H__C7FF953F_4799_48D0_BCDD_2FE4A73499D1__INCLUDED_)
